<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="3" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="position_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="position_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="beam_idx" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="beam_idx">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_97741" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="5" name="ShapeOf_97727" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_97729" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_97731" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Gather_97732" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_97734" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_97736" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_97738" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Concat_97739" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Broadcast_97742" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>0</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="ReadValue_96722" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.9.valuepresent.9.value" variable_type="f32" variable_shape="?,32,?,96" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>0</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.9.value">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_95459" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="Gather_95460" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_85683" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 3072" offset="28" size="12288" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="self.model.embed_tokens.weight" type="Const" version="opset1">
			<data element_type="u8" shape="32064, 3072" offset="12316" size="98500608" />
			<output>
				<port id="0" precision="U8">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Convert_114593" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="self.model.embed_tokens.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="32064, 1" offset="98512924" size="32064" />
			<output>
				<port id="0" precision="U8">
					<dim>32064</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Convert_114596" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>32064</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32064</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="self.model.embed_tokens.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32064</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="self.model.embed_tokens.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="32064, 1" offset="98544988" size="64128" />
			<output>
				<port id="0" precision="FP16">
					<dim>32064</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="self.model.embed_tokens.weight/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32064</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.model.embed_tokens/ov_ext::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.model.embed_tokens/ov_ext::embedding/Convert_1" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.model.embed_tokens/ov_ext::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="28" name="__module.model.embed_tokens/ov_ext::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>32064</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="317,373,384,hidden_states.1,hidden_states.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_85587" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 3072" offset="98609116" size="12288" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_85586" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="98621404" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_85584" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="98621408" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.layers.0.input_layernorm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="374">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_413" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="98621412" size="8" />
			<output>
				<port id="0" precision="I64" names="375">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.model.layers.0.input_layernorm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="376,variance.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_85585" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="98621420" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.model.layers.0.input_layernorm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="377">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="378">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="379,380,hidden_states.5,hidden_states.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="381,383,hidden_states.9">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="self.model.layers.0.self_attn.qkv_proj.weight" type="Const" version="opset1">
			<data element_type="u4" shape="9216, 24, 128" offset="98621424" size="14155776" />
			<output>
				<port id="0" precision="U4">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Convert_114932" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="self.model.layers.0.self_attn.qkv_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u4" shape="9216, 24, 1" offset="112777200" size="110592" />
			<output>
				<port id="0" precision="U4">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Convert_114934" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="self.model.layers.0.self_attn.qkv_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="self.model.layers.0.self_attn.qkv_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="9216, 24, 1" offset="112887792" size="442368" />
			<output>
				<port id="0" precision="FP16">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="self.model.layers.0.self_attn.qkv_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_114939" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="113330160" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_114940" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP16">
					<dim>9216</dim>
					<dim>24</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>9216</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.model.layers.0.self_attn.qkv_proj/ov_ext::linear/ConvertLike" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>9216</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>9216</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.model.layers.0.self_attn.qkv_proj/ov_ext::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>9216</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="390,qkv.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9216</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_457" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_459" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330176" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_461" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330184" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.model.layers.0.self_attn/aten::slice/Reshape" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330192" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.model.layers.0.self_attn/aten::slice/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9216</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="391,query_states.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_92143" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="113330200" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.model.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="395">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.model.layers.0.self_attn/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="113330232" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.model.layers.0.self_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="396,q.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.model.layers.0.self_attn.rotary_emb/aten::unsqueeze/Unsqueeze_1" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1" offset="113330248" size="192" />
			<output>
				<port id="0" precision="FP32" names="419,420">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="ShapeOf_89433" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_89434" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_89435" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="65" name="Gather_89436" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="1068,1229,1390,1551,1712,1873,2034,2195,2356,2517,2678,2839,3000,3161,319,3322,3483,353,3644,3805,3966,4127,421,4288,4449,4610,4771,4932,5093,5254,5415,585,746,907">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_75602" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330184" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_75604" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330184" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.model.layers.0.self_attn.rotary_emb/prim::ListConstruct" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.model.layers.0.self_attn.rotary_emb/aten::expand/Broadcast" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1070,1075,1231,1236,1392,1397,1553,1558,1714,1719,1875,1880,2036,2041,2197,2202,2358,2363,2519,2524,2680,2685,2841,2846,3002,3007,3163,3168,3324,3329,3485,3490,3646,3651,3807,3812,3968,3973,4129,4134,423,428,4290,4295,4451,4456,4612,4617,4773,4778,4934,4939,5095,5100,5256,5261,5417,5422,587,592,748,753,909,914,inv_freq_expanded,inv_freq_expanded.1,inv_freq_expanded.101,inv_freq_expanded.103,inv_freq_expanded.105,inv_freq_expanded.107,inv_freq_expanded.109,inv_freq_expanded.11,inv_freq_expanded.111,inv_freq_expanded.113,inv_freq_expanded.115,inv_freq_expanded.117,inv_freq_expanded.119,inv_freq_expanded.121,inv_freq_expanded.123,inv_freq_expanded.125,inv_freq_expanded.13,inv_freq_expanded.15,inv_freq_expanded.17,inv_freq_expanded.19,inv_freq_expanded.21,inv_freq_expanded.23,inv_freq_expanded.25,inv_freq_expanded.27,inv_freq_expanded.29,inv_freq_expanded.3,inv_freq_expanded.31,inv_freq_expanded.33,inv_freq_expanded.35,inv_freq_expanded.37,inv_freq_expanded.39,inv_freq_expanded.41,inv_freq_expanded.43,inv_freq_expanded.45,inv_freq_expanded.47,inv_freq_expanded.49,inv_freq_expanded.5,inv_freq_expanded.51,inv_freq_expanded.53,inv_freq_expanded.55,inv_freq_expanded.57,inv_freq_expanded.59,inv_freq_expanded.61,inv_freq_expanded.63,inv_freq_expanded.65,inv_freq_expanded.67,inv_freq_expanded.69,inv_freq_expanded.7,inv_freq_expanded.71,inv_freq_expanded.73,inv_freq_expanded.75,inv_freq_expanded.77,inv_freq_expanded.79,inv_freq_expanded.81,inv_freq_expanded.83,inv_freq_expanded.85,inv_freq_expanded.87,inv_freq_expanded.89,inv_freq_expanded.9,inv_freq_expanded.91,inv_freq_expanded.93,inv_freq_expanded.95,inv_freq_expanded.97,inv_freq_expanded.99">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_92144" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="113330440" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.model/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="1071,1232,1393,1554,1715,1876,2037,2198,2359,2520,2681,2842,3003,314,315,3164,3325,3486,3647,3808,3969,4130,424,4291,4452,4613,4774,4935,5096,5257,5418,588,749,910,position_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="239" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="113330184" size="8" />
			<output>
				<port id="0" precision="I64" names="239" />
			</output>
		</layer>
		<layer id="73" name="__module.model.layers.0.self_attn.rotary_emb/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="1072,1073,1233,1234,1394,1395,1555,1556,1716,1717,1877,1878,2038,2039,2199,2200,2360,2361,2521,2522,2682,2683,2843,2844,3004,3005,3165,3166,3326,3327,3487,3488,3648,3649,3809,3810,3970,3971,4131,4132,425,426,4292,4293,4453,4454,4614,4615,4775,4776,4936,4937,5097,5098,5258,5259,5419,5420,589,590,750,751,911,912">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.model.layers.0.self_attn.rotary_emb/aten::to/Convert_4" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="1074,1076,1235,1237,1396,1398,1557,1559,1718,1720,1879,1881,2040,2042,2201,2203,2362,2364,2523,2525,2684,2686,2845,2847,3006,3008,3167,3169,3328,3330,3489,3491,3650,3652,3811,3813,3972,3974,4133,4135,427,429,4294,4296,4455,4457,4616,4618,4777,4779,4938,4940,5099,5101,5260,5262,5421,5423,591,593,752,754,913,915,position_ids_expanded,position_ids_expanded.1,position_ids_expanded.101,position_ids_expanded.103,position_ids_expanded.105,position_ids_expanded.107,position_ids_expanded.109,position_ids_expanded.11,position_ids_expanded.111,position_ids_expanded.113,position_ids_expanded.115,position_ids_expanded.117,position_ids_expanded.119,position_ids_expanded.121,position_ids_expanded.123,position_ids_expanded.125,position_ids_expanded.13,position_ids_expanded.15,position_ids_expanded.17,position_ids_expanded.19,position_ids_expanded.21,position_ids_expanded.23,position_ids_expanded.25,position_ids_expanded.27,position_ids_expanded.29,position_ids_expanded.3,position_ids_expanded.31,position_ids_expanded.33,position_ids_expanded.35,position_ids_expanded.37,position_ids_expanded.39,position_ids_expanded.41,position_ids_expanded.43,position_ids_expanded.45,position_ids_expanded.47,position_ids_expanded.49,position_ids_expanded.5,position_ids_expanded.51,position_ids_expanded.53,position_ids_expanded.55,position_ids_expanded.57,position_ids_expanded.59,position_ids_expanded.61,position_ids_expanded.63,position_ids_expanded.65,position_ids_expanded.67,position_ids_expanded.69,position_ids_expanded.7,position_ids_expanded.71,position_ids_expanded.73,position_ids_expanded.75,position_ids_expanded.77,position_ids_expanded.79,position_ids_expanded.81,position_ids_expanded.83,position_ids_expanded.85,position_ids_expanded.87,position_ids_expanded.89,position_ids_expanded.9,position_ids_expanded.91,position_ids_expanded.93,position_ids_expanded.95,position_ids_expanded.97,position_ids_expanded.99">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.model.layers.0.self_attn.rotary_emb/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1077,1238,1399,1560,1721,1882,2043,2204,2365,2526,2687,2848,3009,3170,3331,3492,3653,3814,3975,4136,4297,430,4458,4619,4780,4941,5102,5263,5424,594,755,916">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.model.layers.0.self_attn.rotary_emb/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="113330456" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.model.layers.0.self_attn.rotary_emb/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1078,1239,1400,1561,1722,1883,2044,2205,2366,2527,2688,2849,3010,3171,3332,3493,3654,3815,3976,4137,4298,431,4459,4620,4781,4942,5103,5264,5425,595,756,917">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.model.layers.0.self_attn.rotary_emb/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1080,1241,1402,1563,1724,1885,2046,2207,2368,2529,2690,2851,3012,3173,3334,3495,3656,3817,3978,4139,4300,433,4461,4622,4783,4944,5105,5266,5427,597,758,919,emb,emb.1,emb.11,emb.13,emb.15,emb.17,emb.19,emb.21,emb.23,emb.25,emb.27,emb.29,emb.3,emb.31,emb.33,emb.35,emb.37,emb.39,emb.41,emb.43,emb.45,emb.47,emb.49,emb.5,emb.51,emb.53,emb.55,emb.57,emb.59,emb.61,emb.7,emb.9">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.model.layers.0.self_attn.rotary_emb/aten::cos/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="1081,1242,1403,1564,1725,1886,2047,2208,2369,2530,2691,2852,3013,3174,3335,3496,3657,3818,3979,4140,4301,434,4462,4623,4784,4945,5106,5267,5428,598,759,920">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_85588" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="113330468" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.model.layers.0.self_attn.rotary_emb/aten::mul/Multiply_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1082,1085,1088,1243,1246,1249,1404,1407,1410,1565,1568,1571,1726,1729,1732,1887,1890,1893,2048,2051,2054,2209,2212,2215,2370,2373,2376,2531,2534,2537,2692,2695,2698,2853,2856,2859,3014,3017,3020,3175,3178,3181,3336,3339,3342,3497,3500,3503,3658,3661,3664,3819,3822,3825,3980,3983,3986,4141,4144,4147,4302,4305,4308,435,438,441,4463,4466,4469,4624,4627,4630,4785,4788,4791,4946,4949,4952,5107,5110,5113,5268,5271,5274,5429,5432,5435,599,602,605,760,763,766,921,924,927,cos.1,cos.103,cos.105,cos.109,cos.111,cos.115,cos.117,cos.121,cos.123,cos.127,cos.129,cos.13,cos.133,cos.135,cos.139,cos.141,cos.145,cos.147,cos.15,cos.151,cos.153,cos.157,cos.159,cos.163,cos.165,cos.169,cos.171,cos.175,cos.177,cos.181,cos.183,cos.187,cos.189,cos.19,cos.21,cos.25,cos.27,cos.3,cos.31,cos.33,cos.37,cos.39,cos.43,cos.45,cos.49,cos.51,cos.55,cos.57,cos.61,cos.63,cos.67,cos.69,cos.7,cos.73,cos.75,cos.79,cos.81,cos.85,cos.87,cos.9,cos.91,cos.93,cos.97,cos.99">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1090,1251,1412,1573,1734,1895,2056,2217,2378,2539,2700,2861,3022,3183,3344,3505,3666,3827,3988,4149,4310,443,4471,4632,4793,4954,5115,5276,5437,607,768,929,cos,cos.101,cos.107,cos.11,cos.113,cos.119,cos.125,cos.131,cos.137,cos.143,cos.149,cos.155,cos.161,cos.167,cos.17,cos.173,cos.179,cos.185,cos.23,cos.29,cos.35,cos.41,cos.47,cos.5,cos.53,cos.59,cos.65,cos.71,cos.77,cos.83,cos.89,cos.95">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.model.layers.0.self_attn/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="445">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_1024" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330472" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_1026" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330480" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_1028" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330184" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.model.layers.0.self_attn/aten::slice/Reshape_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330488" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.model.layers.0.self_attn/aten::slice/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="455,x2.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_85589" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="113330496" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.model.layers.0.self_attn/aten::neg/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="456">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_921" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_965" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330472" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_967" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330184" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.model.layers.0.self_attn/aten::slice/Slice_2" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="450">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.model.layers.0.self_attn/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="458">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.model.layers.0.self_attn.rotary_emb/aten::sin/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="1083,1244,1405,1566,1727,1888,2049,2210,2371,2532,2693,2854,3015,3176,3337,3498,3659,3820,3981,4142,4303,436,4464,4625,4786,4947,5108,5269,5430,600,761,922">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_85590" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="113330468" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.model.layers.0.self_attn.rotary_emb/aten::mul/Multiply_3" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1084,1086,1089,1245,1247,1250,1406,1408,1411,1567,1569,1572,1728,1730,1733,1889,1891,1894,2050,2052,2055,2211,2213,2216,2372,2374,2377,2533,2535,2538,2694,2696,2699,2855,2857,2860,3016,3018,3021,3177,3179,3182,3338,3340,3343,3499,3501,3504,3660,3662,3665,3821,3823,3826,3982,3984,3987,4143,4145,4148,4304,4306,4309,437,439,442,4465,4467,4470,4626,4628,4631,4787,4789,4792,4948,4950,4953,5109,5111,5114,5270,5272,5275,5431,5433,5436,601,603,606,762,764,767,923,925,928,sin.1,sin.103,sin.105,sin.109,sin.111,sin.115,sin.117,sin.121,sin.123,sin.127,sin.129,sin.13,sin.133,sin.135,sin.139,sin.141,sin.145,sin.147,sin.15,sin.151,sin.153,sin.157,sin.159,sin.163,sin.165,sin.169,sin.171,sin.175,sin.177,sin.181,sin.183,sin.187,sin.189,sin.19,sin.21,sin.25,sin.27,sin.3,sin.31,sin.33,sin.37,sin.39,sin.43,sin.45,sin.49,sin.51,sin.55,sin.57,sin.61,sin.63,sin.67,sin.69,sin.7,sin.73,sin.75,sin.79,sin.81,sin.85,sin.87,sin.9,sin.91,sin.93,sin.97,sin.99">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1091,1252,1413,1574,1735,1896,2057,2218,2379,2540,2701,2862,3023,3184,3345,3506,3667,3828,3989,4150,4311,444,4472,4633,4794,4955,5116,5277,5438,608,769,930,sin,sin.101,sin.107,sin.11,sin.113,sin.119,sin.125,sin.131,sin.137,sin.143,sin.149,sin.155,sin.161,sin.167,sin.17,sin.173,sin.179,sin.185,sin.23,sin.29,sin.35,sin.41,sin.47,sin.5,sin.53,sin.59,sin.65,sin.71,sin.77,sin.83,sin.89,sin.95">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.model.layers.0.self_attn/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="459">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="__module.model.layers.0.self_attn/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="460">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_97753" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="103" name="Constant_97746" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_97748" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_97750" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Concat_97751" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Broadcast_97754" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>0</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="ReadValue_96596" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.0.keypresent.0.key" variable_type="f32" variable_shape="?,32,?,96" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>0</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.0.key">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_95402" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="110" name="Gather_95403" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_467" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330176" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_469" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330500" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_471" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="113330184" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.model.layers.0.self_attn/aten::slice/Slice_3" type="Slice" version="opset8">
